marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_FlexIO.h
/**
*   @file    Reg_eSys_FlexIO.h
*   @version 1.0.1
*
*   @brief   AUTOSAR I2c - FlexIO Registers and Macros Definitions.
*   @details Header file for FlexIO Registers and Macros Definitions.
*
*   @addtogroup I2C
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.2 MCAL
*   Platform             : ARM
*   Peripheral           : LPI2C
*   Dependencies         : none
*
*   Autosar Version      : 4.2.2
*   Autosar Revision     : ASR_REL_4_2_REV_0002
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : S32K14x_MCAL_1_0_1_RTM_ASR_REL_4_2_REV_0002_20180713
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017-2018 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_FLEXIO_H
#define REG_ESYS_FLEXIO_H

#ifdef __cplusplus
extern "C"
{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
* @section Reg_eSys_FlexIO_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, This violation is due to function
* like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_FlexIO_h_REF_2
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall
* be checked to ensure that 31 character significance and
* case sensitivity are supported for external identifiers.
* This violation is due to the requirement that requests to have
* a file version check.
*/


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Reg_eSys_FlexIO.h
*/
#define REG_ESYS_FLEXIO_VENDOR_ID                    43
/**
* @violates @ref Reg_eSys_FlexIO_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define REG_ESYS_FLEXIO_AR_RELEASE_MAJOR_VERSION     4
/**
* @violates @ref Reg_eSys_FlexIO_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define REG_ESYS_FLEXIO_AR_RELEASE_MINOR_VERSION     2
/**
* @violates @ref Reg_eSys_FlexIO_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define REG_ESYS_FLEXIO_AR_RELEASE_REVISION_VERSION  2
#define REG_ESYS_FLEXIO_SW_MAJOR_VERSION             1
#define REG_ESYS_FLEXIO_SW_MINOR_VERSION             0
#define REG_ESYS_FLEXIO_SW_PATCH_VERSION             1

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_FLEXIO_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_FLEXIO_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_FlexIO.h and Reg_eSys.h are different"
    #endif
#endif
/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/

/*********************************FLEXIO REGISTERS*********************************/

/**
* @details  FLEXIO macro to access register Version ID Register (VERID).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_VERID_ADDR32(flexio)         ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000000U))

/**
* @details  FLEXIO macro to access register Parameter Register (PARAM).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_PARAM_ADDR32(flexio)         ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000004U))

/**
* @details  FLEXIO macro to access register FlexIO Control Register (CTRL).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_CTRL_ADDR32(flexio)          ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000008U))

/**
* @details  FLEXIO macro to access register Pin State Register (PIN).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_PIN_ADDR32(flexio)           ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x0000000CU))

/**
* @details  FLEXIO macro to access register Shifter Status Register (SHIFTSTAT).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTSTAT_ADDR32(flexio)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000010U))

/**
* @details  FLEXIO macro to access register Shifter Error Register (SHIFTERR).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTERR_ADDR32(flexio)      ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000014U))

/**
* @details  FLEXIO macro to access register Timer Status Register (TIMSTAT).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_TIMSTAT_ADDR32(flexio)       ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000018U))

/**
* @details  FLEXIO macro to access register Shifter Status Interrupt Enable (SHIFTSIEN).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTSIEN_ADDR32(flexio)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000020U))

/**
* @details  FLEXIO macro to access register Shifter Error Interrupt Enable (SHIFTEIEN).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTEIEN_ADDR32(flexio)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000024U))

/**
* @details  FLEXIO macro to access register Timer Interrupt Enable Register (TIMIEN).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_TIMIEN_ADDR32(flexio)        ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000028U))

/**
* @details  FLEXIO macro to access register Shifter Status DMA Enable (SHIFTSDEN).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTSDEN_ADDR32(flexio)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000030U))

/**
* @details  FLEXIO macro to access register Shifter Control N (SHIFTCTL0 - SHIFTCTL3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTCTLn_ADDR32(flexio, shifter)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000080U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Shifter Configuration N (SHIFTCFG0 - SHIFTCFG3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTCFGn_ADDR32(flexio, shifter)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000100U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Shifter Buffer N (SHIFTBUF0 - SHIFTBUF3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTBUFn_ADDR32(flexio, shifter)     ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000200U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Shifter Buffer N Bit Swapped (SHIFTBUFBIS0 - SHIFTBUFBIS3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTBUFBISn_ADDR32(flexio, shifter)  ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000280U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Shifter Buffer N Byte Swapped (SHIFTBUFBYS0 - SHIFTBUFBYS3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTBUFBYSn_ADDR32(flexio, shifter)  ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000300U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Shifter Buffer N Bit Byte Swapped (SHIFTBUFBBS0 - SHIFTBUFBBS3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_SHIFTBUFBBSn_ADDR32(flexio, shifter)  ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000380U + (uint32)((shifter) << 2U)))

/**
* @details  FLEXIO macro to access register Timer Control N (TIMCTL0 - TIMCTL3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_TIMCTLn_ADDR32(flexio, timer)        ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000400U + (uint32)((timer) << 2U)))

/**
* @details  FLEXIO macro to access register Timer Configuration N (TIMCFG0 - TIMCFG3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_TIMCFGn_ADDR32(flexio, timer)        ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000480U + (uint32)((timer) << 2U)))

/**
* @details  FLEXIO macro to access register Timer Compare N (TIMCMP0 - TIMCMP3).
* @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined.
*/
#define FLEXIO_TIMCMPn_ADDR32(flexio, timer)        ((uint32)(FlexIO_au32BaseAddrs[(flexio)] + (uint32)0x00000500U + (uint32)((timer) << 2U)))

