marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_FlexIO.h
/*****************************************FLEXIO BITFIELDS*****************************************/

/**
* @brief    FLEXIO Registers bits.
* @details  CTRL register bit masks.
*/
#define FLEXIO_CTRL_RWBIST_MASK_U32                   ((uint32)0x80000007U)

#define FLEXIO_CTRL_DOZEN_MASK_U32                    ((uint32)0x80000000U)
#define FLEXIO_CTRL_DBGEN_MASK_U32                    ((uint32)0x40000000U)
#define FLEXIO_CTRL_FASTACC_MASK_U32                  ((uint32)0x00000004U)
#define FLEXIO_CTRL_SWRST_MASK_U32                    ((uint32)0x00000002U)
#define FLEXIO_CTRL_FLEXEN_MASK_U32                   ((uint32)0x00000001U)

#define FLEXIO_ENABLED_IN_DBG_U32                     (FLEXIO_CTRL_DBGEN_MASK_U32)
#define FLEXIO_DISABLED_IN_DBG_U32                    ((uint32)0x00000000U)
   
#define FLEXIO_ENABLED_IN_DOZE_U32                    (FLEXIO_CTRL_DOZEN_MASK_U32)
#define FLEXIO_DISABLED_IN_DOZE_U32                   ((uint32)0x00000000U)
   
#define FLEXIO_FAST_REGISTER_ACCESS_U32               (FLEXIO_CTRL_FASTACC_MASK_U32)
#define FLEXIO_NORMAL_REGISTER_ACCESS_U32             ((uint32)0x00000000U)
   
#define FLEXIO_SW_RESET_ENABLED_U32                   (FLEXIO_CTRL_SWRST_MASK_U32)
#define FLEXIO_SW_RESET_DISABLED_U32                  ((uint32)0x00000000U)
   
#define FLEXIO_MODULE_ENABLED_U32                     (FLEXIO_CTRL_FLEXEN_MASK_U32)
#define FLEXIO_MODULE_DISABLED_U32                    ((uint32)0x00000000U)

/**
* @brief    FLEXIO Registers bits.
* @details  PIN register bit masks.
*/
#define FLEXIO_PIN_PDI_MASK_U32                       ((uint32)0x000000FFU)

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTSTAT register bit masks.
*/
#define FLEXIO_SHIFTSTAT_RWBITS_MASK_U32              ((uint32)0x0000000FU)

#define FLEXIO_SHIFTSTAT_SSF_MASK_U32                 ((uint32)0x0000000FU)

/** @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define FLEXIO_SHIFTSTAT_SSF_U32(shifter)             ((uint32)((uint32)1U << (shifter)))

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTERR register bit masks.
*/
#define FLEXIO_SHIFTERR_RWBITS_MASK_U32               ((uint32)0x0000000FU)

/** @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define FLEXIO_SHIFTERR_SEF_U32(shifter)              ((uint32)((uint32)1U << (shifter)))

#define FLEXIO_SHIFTERR_SEF_MASK_U32                  ((uint32)0x0000000FU)

/**
* @brief    FLEXIO Registers bits.
* @details  TIMSTAT register bit masks.
*/
#define FLEXIO_TIMSTAT_RWBITS_MASK_U32                ((uint32)0x0000000FU)

/** @violates @ref Reg_eSys_FlexIO_h_REF_1 MISRA 2004 Advisory Rule 19.7, Function-like macro defined. */
#define FLEXIO_TIMSTAT_TSF_U32(timer)                 ((uint32)((uint32)1U << (timer)))

#define FLEXIO_TIMSTAT_TSF_MASK_U32                   ((uint32)0x0000000FU)

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTSIEN register bit masks.
*/
#define FLEXIO_SHIFTSIEN_RWBITS_MASK_U32              ((uint32)0x0000000FU)

#define FLEXIO_SHIFTSIEN_SSIE_MASK_U32                ((uint32)0x0000000FU)
/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTEIEN register bit masks.
*/
#define FLEXIO_SHIFTEIEN_RWBITS_MASK_U32              ((uint32)0x0000000FU)

#define FLEXIO_SHIFTEIEN_SEIE_MASK_U32                ((uint32)0x0000000FU)

/**
* @brief    FLEXIO Registers bits.
* @details  TIMIEN register bit masks.
*/
#define FLEXIO_TIMIEN_RWBITS_MASK_U32                 ((uint32)0x0000000FU)

#define FLEXIO_TIMIEN_TEIE_MASK_U32                   ((uint32)0x0000000FU)

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTSDEN register bit masks.
*/
#define FLEXIO_SHIFTSDEN_RWBITS_MASK_U32              ((uint32)0x0000000FU)

#define FLEXIO_SHIFTSDEN_SSDE_MASK_U32                ((uint32)0x0000000FU)

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTCTL register bit masks.
*/
#define FLEXIO_SHIFTCTL_RWBITS_MASK_U32               ((uint32)0x03830787U)

#define FLEXIO_SHIFTCTL_TIMSEL_MASK_U32               ((uint32)0x03000000U)
#define FLEXIO_SHIFTCTL_TIMPOL_MASK_U32               ((uint32)0x00800000U)
#define FLEXIO_SHIFTCTL_PINCFG_MASK_U32               ((uint32)0x00030000U)
#define FLEXIO_SHIFTCTL_PINSEL_MASK_U32               ((uint32)0x00000700U)
#define FLEXIO_SHIFTCTL_PINPOL_MASK_U32               ((uint32)0x00000080U)
#define FLEXIO_SHIFTCTL_SMOD_MASK_U32                 ((uint32)0x00000007U)

#define FLEXIO_SHIFTCTL_TIMSEL_SHIFT_U32              ((uint32)24U)

#define FLEXIO_SHIFT_ON_POSEDGE_OF_SHIFT_CLK_U32      ((uint32)0x00000000U)
#define FLEXIO_SHIFT_ON_NEGEDGE_OF_SHIFT_CLK_U32      (FLEXIO_SHIFTCTL_TIMPOL_MASK_U32)
                                                      
#define FLEXIO_SHIFTER_PIN_OUTPUT_DISABLED_U32        ((uint32)0x00000000U)
#define FLEXIO_SHIFTER_PIN_OPEN_DRAIN_U32             ((uint32)0x00010000U)
#define FLEXIO_SHIFTER_PIN_BIDIRECTIONAL_OUTPUT_U32   ((uint32)0x00020000U)
#define FLEXIO_SHIFTER_PIN_OUTPUT_U32                 ((uint32)0x00030000U)

#define FLEXIO_SHIFTCTL_PINSEL_SHIFT_U32              ((uint32)8U)

#define FLEXIO_SHIFTER_PIN_ACTIVE_HIGH_U32            ((uint32)0x00000000U)
#define FLEXIO_SHIFTER_PIN_ACTIVE_LOW_U32             (FLEXIO_SHIFTCTL_PINPOL_MASK_U32)
                                                      
#define FLEXIO_SHIFTER_DISABLED_U32                   ((uint32)0x00000000U)
#define FLEXIO_SHIFTER_RECEIVE_MODE_U32               ((uint32)0x00000001U)
#define FLEXIO_SHIFTER_TRANSMIT_MODE_U32              ((uint32)0x00000002U)
#define FLEXIO_SHIFTER_MATCH_STORE_MODE_U32           ((uint32)0x00000004U)
#define FLEXIO_SHIFTER_MATCH_CONTINUOUS_MODE_U32      ((uint32)0x00000005U)

/**
* @brief    FLEXIO Registers bits.
* @details  SHIFTCFG register bit masks.
*/
#define FLEXIO_SHIFTCFG_RWBITS_MASK_U32               ((uint32)0x00000133U)

#define FLEXIO_SHIFTCFG_INSRC_MASK_U32                ((uint32)0x00000100U)
#define FLEXIO_SHIFTCFG_SSTOP_MASK_U32                ((uint32)0x00000030U)
#define FLEXIO_SHIFTCFG_SSTART_MASK_U32               ((uint32)0x00000003U)

