marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_FlexIO.h
#define FLEXIO_SHIFTER_INPUT_IS_PIN_U32               ((uint32)0x00000000U)
#define FLEXIO_SHIFTER_INPUT_IS_NEXT_SHIFTER_U32      (FLEXIO_SHIFTCFG_INSRC_MASK_U32)
                                                      
#define FLEXIO_STOP_BIT_DIS_U32                       ((uint32)0x00000000U)
#define FLEXIO_STOP_BIT_RESERVED_U32                  ((uint32)0x00000010U)
#define FLEXIO_STOP_BIT_VALUE_0_U32                   ((uint32)0x00000020U)
#define FLEXIO_STOP_BIT_VALUE_1_U32                   ((uint32)0x00000030U)
                                                      
#define FLEXIO_START_BIT_DIS_LOAD_ON_EN_U32           ((uint32)0x00000000U)
#define FLEXIO_START_BIT_DIS_LOAD_ON_SHIFT_U32        ((uint32)0x00000001U)
#define FLEXIO_START_BIT_VALUE_0_U32                  ((uint32)0x00000002U)
#define FLEXIO_START_BIT_VALUE_1_U32                  ((uint32)0x00000003U)


/**
* @brief    FLEXIO Registers bits.
* @details  TIMCTL register bit masks.
*/
#define FLEXIO_TIMCTL_RWBITS_MASK_U32                 ((uint32)0x0FC30783U)

#define FLEXIO_TIMCTL_TRGSEL_MASK_U32                 ((uint32)0x0F000000U)
#define FLEXIO_TIMCTL_TRGPOL_MASK_U32                 ((uint32)0x00800000U)
#define FLEXIO_TIMCTL_TRGSRC_MASK_U32                 ((uint32)0x00400000U)
#define FLEXIO_TIMCTL_PINCFG_MASK_U32                 ((uint32)0x00030000U)
#define FLEXIO_TIMCTL_PINSEL_MASK_U32                 ((uint32)0x00000700U)
#define FLEXIO_TIMCTL_PINPOL_MASK_U32                 ((uint32)0x00000080U)
#define FLEXIO_TIMCTL_TIMOD_MASK_U32                  ((uint32)0x00000003U)

#define FLEXIO_TIMCTL_TRGSEL_SHIFT_U32                ((uint32)24U)
#define FLEXIO_TIMCTL_PINSEL_SHIFT_U32                ((uint32)8U)

#define FLEXIO_TMR_TRIGGER_ACTIVE_HIGH_U32            ((uint32)0x00000000U)
#define FLEXIO_TMR_TRIGGER_ACTIVE_LOW_U32             (FLEXIO_TIMCTL_TRGPOL_MASK_U32)
                                                      
#define FLEXIO_TMR_EXTERNAL_TRIGGER_U32               ((uint32)0x00000000U)
#define FLEXIO_TMR_INTERNAL_TRIGGER_U32               (FLEXIO_TIMCTL_TRGSRC_MASK_U32)
                                                      
#define FLEXIO_TMR_PIN_OUTPUT_DISABLED_U32            ((uint32)0x00000000U)
#define FLEXIO_TMR_PIN_OPEN_DRAIN_U32                 ((uint32)0x00010000U)
#define FLEXIO_TMR_PIN_BIDIRECTIONAL_OUTPUT_U32       ((uint32)0x00020000U)
#define FLEXIO_TMR_PIN_OUTPUT_U32                     ((uint32)0x00030000U)
                                                      
#define FLEXIO_TMR_SELECT_PIN0_U32                    ((uint32)0x00000000U)
#define FLEXIO_TMR_SELECT_PIN1_U32                    ((uint32)0x00000100U)
#define FLEXIO_TMR_SELECT_PIN2_U32                    ((uint32)0x00000200U)
#define FLEXIO_TMR_SELECT_PIN3_U32                    ((uint32)0x00000300U)
                                                      
#define FLEXIO_TMR_PIN_ACTIVE_HIGH_U32                ((uint32)0x00000000U)
#define FLEXIO_TMR_PIN_ACTIVE_LOW_U32                 (FLEXIO_TIMCTL_PINPOL_MASK_U32)
    
#define FLEXIO_TMR_DISABLED_U32                       ((uint32)0x00000000U)
#define FLEXIO_TMR_DUAL_8BIT_BAUD_U32                 ((uint32)0x00000001U)
#define FLEXIO_TMR_DUAL_8BIT_PWM_U32                  ((uint32)0x00000002U)
#define FLEXIO_TMR_SINGLE_16BIT_COUNTER_U32           ((uint32)0x00000003U)

/**
* @brief    FLEXIO Registers bits.
* @details  TIMCFG register bit masks.
*/
#define FLEXIO_TIMCFG_RWBITS_MASK_U32                 ((uint32)0x03377732U)

#define FLEXIO_TIMCFG_TIMOUT_MASK_U32                 ((uint32)0x03000000U)
#define FLEXIO_TIMCFG_TIMDEC_MASK_U32                 ((uint32)0x00300000U)
#define FLEXIO_TIMCFG_TIMRST_MASK_U32                 ((uint32)0x00070000U)
#define FLEXIO_TIMCFG_TIMDIS_MASK_U32                 ((uint32)0x00007000U)
#define FLEXIO_TIMCFG_TIMENA_MASK_U32                 ((uint32)0x00000700U)
#define FLEXIO_TIMCFG_TSTOP_MASK_U32                  ((uint32)0x00000030U)
#define FLEXIO_TIMCFG_TRSTART_MASK_U32                ((uint32)0x00000002U)


#define FLEXIO_TMR_OUT_ONE_ONLY_ON_ENABLE_U32         ((uint32)0x00000000U)
#define FLEXIO_TMR_OUT_ZERO_ONLY_ON_ENABLE_U32        ((uint32)0x01000000U)
#define FLEXIO_TMR_OUT_ONE_ON_ENABLE_AND_RST_U32      ((uint32)0x02000000U)
#define FLEXIO_TMR_OUT_ZERO_ON_ENABLE_AND_RST_U32     ((uint32)0x03000000U)
                                                      
#define FLEXIO_TMR_DECREMENT_ON_FLEXIO_CLK_U32        ((uint32)0x00000000U)
#define FLEXIO_TMR_DECREMENT_ON_TRG_INPUT_U32         ((uint32)0x00100000U)
#define FLEXIO_TMR_DECREMENT_ON_PIN_INPUT_U32         ((uint32)0x00200000U)
/**
* @violates @ref Reg_eSys_FlexIO_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define FLEXIO_TMR_DECREMENT_ON_TRG_INPUT_INV_U32     ((uint32)0x00300000U)
                                                      
#define FLEXIO_TMR_NEVER_RST_U32                      ((uint32)0x00000000U)
#define FLEXIO_TMR_RST_ON_PIN_EQ_OUT_U32              ((uint32)0x00020000U)
#define FLEXIO_TMR_RST_ON_TRG_EQ_OUT_U32              ((uint32)0x00030000U)
#define FLEXIO_TMR_RST_ON_PIN_RISING_EDGE_U32         ((uint32)0x00040000U)
#define FLEXIO_TMR_RST_ON_TRG_RISING_EDGE_U32         ((uint32)0x00060000U)
#define FLEXIO_TMR_RST_ON_TRG_BOTH_EDGES_U32          ((uint32)0x00070000U)
                                                      
#define FLEXIO_TMR_NEVER_DIS_U32                      ((uint32)0x00000000U)
#define FLEXIO_TMR_DIS_ON_PREV_TMR_DIS_U32            ((uint32)0x00001000U)
#define FLEXIO_TMR_DIS_ON_TMR_COMP_U32                ((uint32)0x00002000U)
#define FLEXIO_TMR_DIS_ON_TMR_COMP_AND_TRG_LOW_U32    ((uint32)0x00003000U)
#define FLEXIO_TMR_DIS_ON_PIN_EDGES_U32               ((uint32)0x00004000U)
#define FLEXIO_TMR_DIS_ON_PIN_EDGES_AND_TRG_HIGH_U32   ((uint32)0x00005000U)
#define FLEXIO_TMR_DIS_ON_TRG_FALLING_EDGE_U32        ((uint32)0x00006000U)
                                                      
#define FLEXIO_TMR_ALWAYS_ENABLED_U32                 ((uint32)0x00000000U)
#define FLEXIO_TMR_EN_ON_PREV_TMR_EN_U32              ((uint32)0x00000100U)
#define FLEXIO_TMR_EN_ON_TRG_HIGH_U32                 ((uint32)0x00000200U)
#define FLEXIO_TMR_EN_ON_TRG_HIGH_AND_PIN_HIGH_U32    ((uint32)0x00000300U)
#define FLEXIO_TMR_EN_ON_PIN_RISING_U32               ((uint32)0x00000400U)
#define FLEXIO_TMR_EN_ON_PIN_RISING_AND_TRG_HIGH_U32  ((uint32)0x00000500U)
#define FLEXIO_TMR_EN_ON_TRG_RISING_EDGE_U32          ((uint32)0x00000600U)
#define FLEXIO_TMR_EN_ON_TRG_BOTH_EDGES_U32           ((uint32)0x00000700U)

#define FLEXIO_TMR_STOP_BIT_DISABLED_U32              ((uint32)0x00000000U)
#define FLEXIO_TMR_STOP_BIT_ON_TMR_COMP_U32           ((uint32)0x00000010U)
#define FLEXIO_TMR_STOP_BIT_ON_TMR_DIS_U32            ((uint32)0x00000020U)
/**
* @violates @ref Reg_eSys_FlexIO_h_REF_2 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define FLEXIO_TMR_STOP_BIT_ON_TMR_COMP_AND_DIS_U32   ((uint32)0x00000030U)
                                                      
#define FLEXIO_TMR_START_BIT_DISABLED_U32             ((uint32)0x00000000U)
#define FLEXIO_TMR_START_BIT_ENABLED_U32              (FLEXIO_TIMCFG_TRSTART_MASK_U32)

/**
* @brief    FLEXIO Registers bits.
* @details  TIMCMP register bit masks.
*/
#define FLEXIO_TIMCMP_RWBITS_MASK_U32                 ((uint32)0x0000FFFFU)

#define FLEXIO_TIMCMP_BAUD_MASK_U32                   ((uint32)0x000000FFU)
#define FLEXIO_TIMCMP_BITS_NUMBER_MASK_U32            ((uint32)0x0000FF00U)

