marshallma21/AUTOSAR_SampleProject_S32K144/plugins/I2c_TS_T40D2M10I1R0/include/Reg_eSys_FlexIO.h
#define FLEXIO_READ_BIT_U8                            ((uint8)0x01U)
                                                      
#define FLEXIO_SHIFTBUFBIS_SHIFT_VALUE_U32            ((uint32)24U)
                                                      
#define FLEXIO_STOP_BYTE_VALUE_U32                    ((uint32)0x0U)
                                                      
#define FLEXIO_LEAVE_SDA_FREE_U32                     ((uint32)0xFF)
                                                      
#define FLEXIO_SUBCHANNELS_PER_MODULE_U8              ((uint8)2U)

#define FLEXIO_FIRST_SUBCHANNEL_FLAGS_U32             ((uint32)0x3U)
#define FLEXIO_SECOND_SUBCHANNEL_FLAGS_U32            ((uint32)0xCU)

#define FLEXIO_GENERIC_IEN_RWBITS_MASK_U32            ((uint32)0x0000000FU)
                                                      
#define FLEXIO_INVALID_HW_CHANNEL_U8                  ((uint8)0xFFU)
/*==================================================================================================
                                             ENUMS
==================================================================================================*/

/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_eSys_FLEXIO_H */

/** @} */
